{"note": "Substack is the best decision I've made.\n\nNot because it's easy.\n\nBut because it's mine.\n\nNo algorithms. No noise.\n\nJust real conversations with people who care.\n\nJust my work going into the digital realm.\n\nIf you're building something here, keep going.\n\nThe best is ahead.", "likes": 150}
{"note": "Today is a big day.\n\nI just matched my old annual corporate salary with my monthly creator income. 🥹🙌\n\nNo meetings. No bosses. No pretending to care about office birthdays.\n\nJust writing, sharing, and showing up.\n\nLet this be your sign:\n\nBet on yourself. It pays off. 💛", "likes": 1100}
{"note": "I love Substack. I have no followers on here. I barely know how to work this app. I suck at writing. I'm 28 and feeling so lost. So stupid. And contemplating on if life is worth living on the daily. But I get on here, and see random ppl say insightful, encouraging, uplifting things.. and it s sweet reminder, for me, that I'll be okay. It'll be okay.", "likes": 2500}
{"note": "My Substack growth jumped by 7K in 1 month:\n\nPost daily Notes\n\nReply to people\n\nLike as you scroll\n\nShow up. Be human. It works.", "likes": 1800}
{"note": "My first month on Substack, I had 10 subscribers—it paid for a coffee.\n\nBy month two, I had 9K subscribers—it paid for my groceries.\n\nAfter three months, I was making $5,000/month.\n\nNow, I've made over $50,000 writing on Substack.\n\nThis could be YOU, but you're stuck overthinking your first post.\n\nStart messy. I've got you. 💌", "likes": 9200}
{"note": "CBS's parent company Paramount may settle Trump's frivolous lawsuit against 60 Minutes. Why?\n\nSo it can get approval from Trump's FCC to be acquired by Skydance for $8 billion. Skydance was founded by the son of Larry Ellison, one of Trump's major backers.\n\nHello?", "likes": 2900}
{"note": "the brand lush quit social media three years ago. i can't stop thinking about this quote on why they left.", "likes": 2100}
{"note": "I made $0 from my newsletter in 2024.\n\nGrew it to 28,000 subscribers but kept it 100% free.\n\nWhy? Because giving value first is how you build an empire.\n\nThe money comes later.\n\nTrust comes now.\n\nDrop a ❤️ if you're playing the long game too.", "likes": 483}
{"note": "This is my first post on Substack. I'm a little nervous moving on from Facebook and Instagram, but I'm willing to give it a try.\n\nThis is a watercolor I recently completed. It was inspired by an oil painting, but unfortunately I have not found the original artists name. Sorry 😬 #watercolor #Art #MinnesotaArtist #landscape #winterlandscape", "likes": 3313}
{"note": "America now has 815 billionaires who currently hold a record $6.7 trillion in wealth.\n\nThe bottom 50% of Americans control $3.7 trillion in wealth.\n\nWhen 815 people control more wealth than half a country's population, we have a very serious problem.", "likes": 15600}
{"note": "America's four largest potato producers allegedly conspired to raise prices on frozen fries, hash browns, and tater tots by 47%.\n\nThis tater trust controls more than 95% of the potato market.\n\nIf we want to bring down grocery prices, we must take on corporate consolidation.", "likes": 10600}
{"note": "🤝 so true. Something I learned a lot this year. \n\nJust make it exist first\nYou can make it great later.", "likes": 8300}
{"note": "3 days on Substack and I've realised how many lies exist on the rest of the internet. Long form content isn't dead. Writing isn't a waste of time. And there are oodles of likeminded people longing for depth and substance. Honey, I'm home. 🥹💗", "likes": 3500}
{"note": "Start in December.\n\nStart in your 40's.\n\nStart on Monday.\n\nStart at 7am.\n\nStart on the 31st.\n\nStart late.\n\nStart.", "likes": 3000}
{"note": "Tomorrow, I celebrate 3 years of being sober from drugs and alcohol, and it's been the best thing that ever happened to me.\n\nI had my last drink on November 21, 2021, at a play date at the zoo with my son Evan. I had brought a yeti full of Jameson to the zoo for a 9:00am play date, which would end up being my last drink. It was a blurry moment, and I didn't intend to get sober, but I did want to end my life. I called my mom to ensure Evan would be taken care of without me around. She picked me up 10 minutes later. I spent the rest of the next day sleeping it off, promising to attend a 6:00 pm meeting the next day. Little did I know that this day would mark the beginning of my journey to sobriety. My husband also attended the meeting with me, and he also hasn't had a drink or drug since then either. We do recover!", "likes": 3300}
{"note": "A reminder for myself and others:\nBetter to write for yourself and have no public\nThan to write for the public and have no self.", "likes": 6600}
{"note": "My kid asked me what I used to play on the iPad as a kid, and I told him I talked into a fan to sound like a robot.", "likes": 3300}
{"note": "I don't even know how to feel right now. After decades of writing nonfiction and telling myself I could never \"just make up a story,\" I've finished the first draft of my mystery novel. It needs a ton of work of course, but I did it! This has honestly been so fun. By the way, I'm 55. It's never too late to try something new!", "likes": 1200}
{"note": "we're at the start of a huge shift where gen z is stepping away from dopamine culture. i've been seeing sooo much about people quitting social media! and about realizing how much their creative expression is being affected by consumption. honestly excited to see where we go from here", "likes": 3200}
{"note": "Bilbo didn't finish writing his first book until he was 128. It's never too late.", "likes": 2300}
{"note": "If you cringe over what you wrote 6 months ago.\n\nCongrats.\n\nYour writing is improving.\n\nKeep showing up.", "likes": 710}
{"note": "Sometimes, it feels like I am writing for no one. Maybe just the crickets.\n\nBut hey! At least my writing space is cozy....", "likes": 825}
{"note": "I love when people I've never interacted with on Substack like my notes or posts b/c I then get to go check out accounts I've never seen before and discover so many beautiful writers/creators I might not have otherwise found. It's connecting.", "likes": 1300}
{"note": "Today I hosted a Substack Writers Meetup for myself, in which I sat at home alone and read my own posts. It was a highly enjoyable event, and I look forward to the next edition.", "likes": 411}
{"note": "You feel terrible because you keep consuming more information instead of taking action.", "likes": 461}
{"note": "Unpopular opinion: Substack seems overflowing with writers writing about how to write on Substack.\n\nHelp me fix my \"feed.\" If you have a Substack about something REAL, hit me up with the link so I can follow/subscribe.\n\nLooking for content about pets, relationships, hobbies, business, self-development, aging, ex-patting (that's totally a word), and finance—basically anything that's not about Substack, please and thank you!", "likes": 412}
{"note": "Stop overthinking.\n\nIt's getting you nowhere and ruining your life.", "likes": 268}
{"note": "Knowing that behind every and any interaction on Substack is\n\nanother human (not a bot)\n\na creative soul\n\na person searching for their existing tribe OR wanting to start their own\n\nhow social media intended community and connection to look like\n\na reader and writer's hospitality hub\n\nAnd that's why I resonate with this platform, hard. Do you feel it, too?", "likes": 350}
{"note": "Your job as a writer is to write.\n\nThe world can decide whether to read or not.", "likes": 500}
{"note": "You need to write at least 50 newsletters before expecting success.\n\nDid Lebron become a great basketball player after 50 practices?\n\nWhat about 100?\n\n1,000?\n\nWhy do we expect to be Stephen King after publishing our 5th newsletter?\n\nWriting is a LONG GAME.\n\nLike everything else.\n\nPut your head down.\n\nEnjoy the process.\n\nSuccess will come later.", "likes": 200}
{"note": "I want to find more people on Substack who are just writing because they are inspired to do so. Not writers who want to lead me to their Substack masterclass or reveal the real secrets once I enter my name and email address on the slick landing page. Just writers sharing poetry, magical stories and/or genuine snippets of their lives unfolding in real time.\n\nBonus points if you want to sell all your worldly possessions and live in a cabin in the woods\n\nWhere are my people? ❤️❤️❤️", "likes": 1600}
{"note": "840 books.\n\nThe average person reads 12 books per year and we get about 70 years of reading life.\n\nSome people read much less. Others, much more. The number is finite.\n\n—\n\nMy name is Matthew. I am a retired naval officer who is passionate about reading and living life to the fullest. On my substack, Beyond the Bookshelf, you fill find:\n\nDiscussions about the connection between life and literature.\n\nRecommendations and reviews on great reads\n\nGuidance on lifelong education through reading\n\nA community of like-minded readers\n\nIf you love life and literature, say hi! I would love to connect.", "likes": 1800}
{"note": "What I want:\n\nTo exchange cash for products and services\n\nWhat I don't want:\n\nTo create an account\n\nTo download your app\n\nTo sign up for your club\n\nTo complete a survey\n\nTo get texts and emails from you for the rest of my life\n\nTo get emails from other people you sold my data to", "likes": 2000}
{"note": "Waking up at 5 AM is dumb.\n\nIgnore the productivity gurus.\n\nPersonal freedom is waking up whenever you want.", "likes": 277}
{"note": "Probably the most important advice I can give:\n\nMake your Substack what you want it to be, not what you think people want.\n\n***\n\n***\n\nI'm talking about what features you offer. If video makes you cringe, don't do it. If you don't like responding to comments, turn them off. If you don't want DMs, turn them off. Almost all features on Substack are optional. It's a beautiful thing.\n\nWill you not grow as fast? Will you lose subscribers? Possibly, depending on the feature and what you offer (we really don't know—it's all so individual and Substack is such a work in progress), but your Substack should be a place you love to hang out in.", "likes": 722}
{"note": "We pay too much attention to the most confident voices—and too little attention to the most thoughtful ones.\n\nCertainty is not a sign of credibility. Speaking assertively is not a substitute for thinking deeply.\n\nIt's better to learn from complex thinkers than smooth talkers.", "likes": 12300}
