{"note": "Substack is the best decision I've made.\n\nNot because it's easy.\n\nBut because it's mine.\n\nNo algorithms. No noise.\n\nJust real conversations with people who care.\n\nJust my work going into the digital realm.\n\nIf you're building something here, keep going.\n\nThe best is ahead.", "likes": 150}
{"note": "Today is a big day.\n\nI just matched my old annual corporate salary with my monthly creator income. 🥹🙌\n\nNo meetings. No bosses. No pretending to care about office birthdays.\n\nJust writing, sharing, and showing up.\n\nLet this be your sign:\n\nBet on yourself. It pays off. 💛", "likes": 1100}
{"note": "I love Substack. I have no followers on here. I barely know how to work this app. I suck at writing. I'm 28 and feeling so lost. So stupid. And contemplating on if life is worth living on the daily. But I get on here, and see random ppl say insightful, encouraging, uplifting things.. and it s sweet reminder, for me, that I'll be okay. It'll be okay.", "likes": 2500}
{"note": "My Substack growth jumped by 7K in 1 month:\n\nPost daily Notes\n\nReply to people\n\nLike as you scroll\n\nShow up. Be human. It works.", "likes": 1800}
{"note": "My first month on Substack, I had 10 subscribers—it paid for a coffee.\n\nBy month two, I had 9K subscribers—it paid for my groceries.\n\nAfter three months, I was making $5,000/month.\n\nNow, I've made over $50,000 writing on Substack.\n\nThis could be YOU, but you're stuck overthinking your first post.\n\nStart messy. I've got you. 💌", "likes": 9200}
{"note": "CBS's parent company Paramount may settle Trump's frivolous lawsuit against 60 Minutes. Why?\n\nSo it can get approval from Trump's FCC to be acquired by Skydance for $8 billion. Skydance was founded by the son of Larry Ellison, one of Trump's major backers.\n\nHello?", "likes": 2900}
{"note": "the brand lush quit social media three years ago. i can't stop thinking about this quote on why they left.", "likes": 2100}
{"note": "I made $0 from my newsletter in 2024.\n\nGrew it to 28,000 subscribers but kept it 100% free.\n\nWhy? Because giving value first is how you build an empire.\n\nThe money comes later.\n\nTrust comes now.\n\nDrop a ❤️ if you're playing the long game too.", "likes": 483}
{"note": "This is my first post on Substack. I'm a little nervous moving on from Facebook and Instagram, but I'm willing to give it a try.\n\nThis is a watercolor I recently completed. It was inspired by an oil painting, but unfortunately I have not found the original artists name. Sorry 😬 #watercolor #Art #MinnesotaArtist #landscape #winterlandscape", "likes": 3313}
{"note": "America now has 815 billionaires who currently hold a record $6.7 trillion in wealth.\n\nThe bottom 50% of Americans control $3.7 trillion in wealth.\n\nWhen 815 people control more wealth than half a country's population, we have a very serious problem.", "likes": 15600}
{"note": "America's four largest potato producers allegedly conspired to raise prices on frozen fries, hash browns, and tater tots by 47%.\n\nThis tater trust controls more than 95% of the potato market.\n\nIf we want to bring down grocery prices, we must take on corporate consolidation.", "likes": 10600}
{"note": "🤝 so true. Something I learned a lot this year. \n\nJust make it exist first\nYou can make it great later.", "likes": 8300}
{"note": "3 days on Substack and I've realised how many lies exist on the rest of the internet. Long form content isn't dead. Writing isn't a waste of time. And there are oodles of likeminded people longing for depth and substance. Honey, I'm home. 🥹💗", "likes": 3500}
{"note": "Start in December.\n\nStart in your 40's.\n\nStart on Monday.\n\nStart at 7am.\n\nStart on the 31st.\n\nStart late.\n\nStart.", "likes": 3000}
{"note": "Tomorrow, I celebrate 3 years of being sober from drugs and alcohol, and it's been the best thing that ever happened to me.\n\nI had my last drink on November 21, 2021, at a play date at the zoo with my son Evan. I had brought a yeti full of Jameson to the zoo for a 9:00am play date, which would end up being my last drink. It was a blurry moment, and I didn't intend to get sober, but I did want to end my life. I called my mom to ensure Evan would be taken care of without me around. She picked me up 10 minutes later. I spent the rest of the next day sleeping it off, promising to attend a 6:00 pm meeting the next day. Little did I know that this day would mark the beginning of my journey to sobriety. My husband also attended the meeting with me, and he also hasn't had a drink or drug since then either. We do recover!", "likes": 3300}
{"note": "A reminder for myself and others:\nBetter to write for yourself and have no public\nThan to write for the public and have no self.", "likes": 6600}
{"note": "My kid asked me what I used to play on the iPad as a kid, and I told him I talked into a fan to sound like a robot.", "likes": 3300}
{"note": "I don't even know how to feel right now. After decades of writing nonfiction and telling myself I could never \"just make up a story,\" I've finished the first draft of my mystery novel. It needs a ton of work of course, but I did it! This has honestly been so fun. By the way, I'm 55. It's never too late to try something new!", "likes": 1200}
{"note": "we're at the start of a huge shift where gen z is stepping away from dopamine culture. i've been seeing sooo much about people quitting social media! and about realizing how much their creative expression is being affected by consumption. honestly excited to see where we go from here", "likes": 3200}
{"note": "Bilbo didn't finish writing his first book until he was 128. It's never too late.", "likes": 2300}
{"note": "If you cringe over what you wrote 6 months ago.\n\nCongrats.\n\nYour writing is improving.\n\nKeep showing up.", "likes": 710}
{"note": "Sometimes, it feels like I am writing for no one. Maybe just the crickets.\n\nBut hey! At least my writing space is cozy....", "likes": 825}
{"note": "I love when people I've never interacted with on Substack like my notes or posts b/c I then get to go check out accounts I've never seen before and discover so many beautiful writers/creators I might not have otherwise found. It's connecting.", "likes": 1300}
{"note": "Today I hosted a Substack Writers Meetup for myself, in which I sat at home alone and read my own posts. It was a highly enjoyable event, and I look forward to the next edition.", "likes": 411}
{"note": "You feel terrible because you keep consuming more information instead of taking action.", "likes": 461}
{"note": "Unpopular opinion: Substack seems overflowing with writers writing about how to write on Substack.\n\nHelp me fix my \"feed.\" If you have a Substack about something REAL, hit me up with the link so I can follow/subscribe.\n\nLooking for content about pets, relationships, hobbies, business, self-development, aging, ex-patting (that's totally a word), and finance—basically anything that's not about Substack, please and thank you!", "likes": 412}
{"note": "Stop overthinking.\n\nIt's getting you nowhere and ruining your life.", "likes": 268}
{"note": "Knowing that behind every and any interaction on Substack is\n\nanother human (not a bot)\n\na creative soul\n\na person searching for their existing tribe OR wanting to start their own\n\nhow social media intended community and connection to look like\n\na reader and writer's hospitality hub\n\nAnd that's why I resonate with this platform, hard. Do you feel it, too?", "likes": 350}
{"note": "Your job as a writer is to write.\n\nThe world can decide whether to read or not.", "likes": 500}
{"note": "You need to write at least 50 newsletters before expecting success.\n\nDid Lebron become a great basketball player after 50 practices?\n\nWhat about 100?\n\n1,000?\n\nWhy do we expect to be Stephen King after publishing our 5th newsletter?\n\nWriting is a LONG GAME.\n\nLike everything else.\n\nPut your head down.\n\nEnjoy the process.\n\nSuccess will come later.", "likes": 200}
{"note": "I want to find more people on Substack who are just writing because they are inspired to do so. Not writers who want to lead me to their Substack masterclass or reveal the real secrets once I enter my name and email address on the slick landing page. Just writers sharing poetry, magical stories and/or genuine snippets of their lives unfolding in real time.\n\nBonus points if you want to sell all your worldly possessions and live in a cabin in the woods\n\nWhere are my people? ❤️❤️❤️", "likes": 1600}
{"note": "840 books.\n\nThe average person reads 12 books per year and we get about 70 years of reading life.\n\nSome people read much less. Others, much more. The number is finite.\n\n—\n\nMy name is Matthew. I am a retired naval officer who is passionate about reading and living life to the fullest. On my substack, Beyond the Bookshelf, you fill find:\n\nDiscussions about the connection between life and literature.\n\nRecommendations and reviews on great reads\n\nGuidance on lifelong education through reading\n\nA community of like-minded readers\n\nIf you love life and literature, say hi! I would love to connect.", "likes": 1800}
{"note": "What I want:\n\nTo exchange cash for products and services\n\nWhat I don't want:\n\nTo create an account\n\nTo download your app\n\nTo sign up for your club\n\nTo complete a survey\n\nTo get texts and emails from you for the rest of my life\n\nTo get emails from other people you sold my data to", "likes": 2000}
{"note": "Waking up at 5 AM is dumb.\n\nIgnore the productivity gurus.\n\nPersonal freedom is waking up whenever you want.", "likes": 277}
{"note": "Probably the most important advice I can give:\n\nMake your Substack what you want it to be, not what you think people want.\n\n***\n\n***\n\nI'm talking about what features you offer. If video makes you cringe, don't do it. If you don't like responding to comments, turn them off. If you don't want DMs, turn them off. Almost all features on Substack are optional. It's a beautiful thing.\n\nWill you not grow as fast? Will you lose subscribers? Possibly, depending on the feature and what you offer (we really don't know—it's all so individual and Substack is such a work in progress), but your Substack should be a place you love to hang out in.", "likes": 722}
{"note": "We pay too much attention to the most confident voices—and too little attention to the most thoughtful ones.\n\nCertainty is not a sign of credibility. Speaking assertively is not a substitute for thinking deeply.\n\nIt's better to learn from complex thinkers than smooth talkers.", "likes": 12300}
{"note": "Today I was blessed with a delayed flight. At the gate, an older gentleman meticulously arranged postcards on the seat next to him. I asked about them. His eyes lit up.\n\n\"Memory collection,\" he said softly. \"Alzheimer's runs in my blood… I keep a piece of everywhere I've been.\"\n\nEach postcard had a date, a place, a small detail:\n- \"The café with yellow doors\"\n- \"Where I heard that beautiful violin\"\n- \"The bookstore with the gang of cats outside\"\n\nI couldn't believe it. \"I do the same thing!\" I said. I mean, Alzheimer's doesn't run in my family. But I like to say I'm an amateur documentarian…\n\nWe talked for 30 minutes. He was carrying postcards for his granddaughter. I keep mine on my fridge. \"Doesn't that get chaotic?\" he asked.\n\n\"Yeah, but I have ADHD, so not really!\" That led to another 30 minutes of conversation.\n\nHe reminded me: sometimes the most beautiful memories are born from chaos. A messy fridge full of stories. A delayed flight that leads to finding your people.\n\nCheers to fate at gate C8.", "likes": 1900}
{"note": "I print every Substack article I read, bind it like a tiny book, and put it on my bookshelf. So, in my eyes, all of you are published authors.", "likes": 6370}
{"note": "To the girl who feels God calling her into a new season, remember:\n\n• You often have to let go before receiving.\n• Uncertainty is part of stepping in faith.\n• Change can be beautiful.\n• God wouldn't call you to it if you weren't capable.\n• Where you can't, He can.", "likes": 508}
{"note": "The morning greeted me with a throbbing headache, courtesy of my husband's midnight symphony of snores. I woke up exhausted and irritable, desperate for hydration. I decided to walk to the market for Tylenol and a coconut—my go-to life hack when I'm this depleted.\n\nThat's when I saw her—our new elderly neighbor, frantically flagging down dog walkers and work-goers. I'd seen her move in with her (presumably) children and grandbaby. Usually, I'd stop, but today I was running on empty and ready to walk by.\n\nShe was persistent. She spoke in Vietnamese, and I mumbled \"I'm sorry\" as I walked off. But something whispered, \"Go back, now.\"\n\nI turned around. Google Translate became our bridge.\n\nI flashed my phone: \"Tôi có thể giúp gì?\" (How can I help?)\n\nShe pulled out her phone: \"I ordered food for my family. It was delivered to the wrong house. Do you know where?\"\n\nI did. I pointed her in the right direction and walked off, feeling like I had done my duty. But then, God himself seemed to scream, \"GO BACK!\"\n\nI turned around, tripping over my own urgency. Now I was the one flagging her down. I mimed walking with her—her face lit up with understanding.\n\nWe walked side by side. She spoke Vietnamese. I spoke English. Neither of us understood the words, but we understood the mission.\n\nAfter 15 minutes (I had the wrong porch!), we found her food. Her joy needed no translation. \"Thank you,\" she said in English. \"No, thank you,\" I replied, meaning every word.\n\nI walked home, realizing I had forgotten the market entirely—but I felt alive, sharp, and perfectly okay.\n\nSomewhere between Google Translate and her grandiose smile, my headache had vanished. And I realized: sometimes the best way to help ourselves is by simply helping others.", "likes": 516}
{"note": "Whenever I say, "I wouldn't be who I am or have this level of success without my husband," someone responds, "Oh no, don't say that!"—as if acknowledging his support diminishes my own strength.\n\nBut here's what folks don't see:\n\nWhen I was scared to quit my job, my husband reminded me that whatever happens, he'd be there to support me.\n\nWhen I called him about my first major rejection, he came home with cans of boiled peanuts—my comfort food—and shelled them as I cried in his lap. Then, he helped me create an \"emotional game plan\" for the next rejection.\n\nWhen ADHD became too much, and I was ready to give up, he helped organize my chaos and reminded me of my capabilities.\n\nHe mastered treating me like a dainty princess while honoring me as a strong woman. He's guided me to new levels, shifted my beliefs, picked me up, and kept me grounded. He's the calm to my crazy, the executor to my visionary.\n\nPartnership is beautiful, and there's absolutely nothing wrong with support, healthy dependence, and having someone to lean on.", "likes": 954}
{"note": "When I quit my job almost 6 years ago, I found myself in my dad's office, tears streaming down my face, confessing how much I missed having a stable paycheck.\n\nI was doing well in business, so I thought he'd tell me to toughen up. Instead, my father—a multimillionaire who's never worked a 'real job' in his life—surprised me with his transparency:\n\nHe felt the exact same way.\n\nEven now, with an upper 5-figure book advance and dual contracts for hosting and writing, I catch myself planning for future uncertainties.\n\nBut I'll tell you what my dad told me: All I can do, all any of us can do, is continuously say yes to using the gifts we were given—because God doesn't provide vision without provision.\n\nThat craving for predictability? It's not a sign you're failing; it's just part of the journey.\n\nThe trick isn't waiting for the fear to disappear, it's learning to create alongside it.\n\nWake up. Create. Pitch. Rest. Repeat.\n\nYou got this.", "likes": 238}
{"note": "9 years sober today. God damn, I'm grateful to be alive, to be here. Recovery is the ultimate gift. Everyone deserves this.", "likes": 423}
{"note": "Three things I like about Substack:\n\n1. You meet a better class of person.\n2. It's not run by the greediest man in the world.\n3. I've forgotten what this one is.", "likes": 15400}
{"note": "I closed my X account recently. I'd love to say letting my few thousand followers there know that I was leaving for good led to an influx of new subscribers here, but it didn't. No one saw the post because the muppets at X buried it.\n\nI'm happy to be somewhere sane.\n\nIf you're interested in ecology, biodiversity, climate change, freshwater, join me here.", "likes": 8200}
{"note": "I'm not a fan of the word 'viral.' It's too clinical, too clinical. It's like saying 'I'm going to make a viral video.' No one wants to make a viral video. They want to make a video that people will watch. Viral is a word that's used to describe something that's popular, but it's not a word that's used to describe something that's good. It's not a word that's used to describe something that's authentic. It's not a word that's used to describe something that's meaningful.", "likes": 1200}
{"note": "Just getting started on Substack, excited to be here and looking forward to seeing old friends and meeting new ones. More soon.", "likes": 1900}
{"note": "Some of the boys at the gym didn't like this one... and I'm just getting started.", "likes": 2300}
{"note": "The world wants you passive. It wants you consuming, not creating. Watching, not doing. Obeying, not thinking. The moment you break that cycle, you become dangerous.", "likes": 676}
{"note": "Substack is the only platform not currently owned by a billionaire, and I have full editorial control over my content.\n\nIt's why I'm here.", "likes": 16500}
{"note": "If you are a girl in your 20s who once romanticized the idea of working in journalism as a little girl, you might like my posts.\n\nMy Substack is an exploration of:\n\n• Personal essays\n• Short stories\n• Poetry\n• Over-analyzing film", "likes": 2600}
{"note": "You need 3 daily wins:\n\n1) A physical win:\n   • Walking, running, lifting, swimming...\n\n2) A mental win:\n   • Reading, writing, creating, learning...\n\n3) A spiritual win:\n   • Praying, meditating, studying, growing...\n\nSubscribe and let's grow together.", "likes": 1100}
{"note": "So it's dangerous for China to have the ability to access our data and manipulate us via social media apps.\n\nBut it's okay for America's billionaires to have the ability to access our data and manipulate us via social media apps.\n\nDo I have this right?", "likes": 49000}
{"note": "In the midst of everything happening in the world, it's a reminder to find peace in the small, grounding moments—time with loved ones, a quiet pause in your day, or simply focusing on what you can control. We can't fix it all, but we can create beauty where we are.", "likes": 28000}
{"note": "In toxic relationships, you're forced to choose between honesty and loyalty. You bite your tongue to protect their ego.\n\nIn healthy relationships, honesty is an expression of loyalty. You speak your mind to help them grow.\n\nWhen you have trust and respect, candor shows care.", "likes": 2200}
{"note": "Calling all lovers of...\n\n✨ Books (romance, fantasy, & thrillers)\n✨ Funny, relatable bookish content\n✨ Weekly newsletters with deep, unfiltered thoughts & reviews on our book club pick\n✨ Being a part of a reading community\n✨ A never-ending list of book recs\n\nWelcome to the bookish club :) Subscribe to join!", "likes": 2200}
{"note": "6 Fundamental rules of life:\n\n• Talk slowly\n• Speak less\n• Family over everything\n• Long walks in nature\n• Smile more\n• Never stop learning\n\nSubscribe to us for free.", "likes": 1900}
{"note": "The great Quantum Physicist Niels Bohr had been having dinner with a friend. They were standing on the front step, saying 'Goodbye' when the friend looked up and saw, nailed above the door, a horseshoe, the Danish good luck charm.\n\n"Niels," he said, "You're superstitious!?"\n\n"Not at all," said Niels, "but apparently it works anyway."", "likes": 2100}
{"note": ""I don't know" is not an admission of ignorance. It's an expression of intellectual humility.\n\n"I was wrong" is not a confession of failure. It's a display of intellectual integrity.\n\n"I don't understand" is not a sign of stupidity. It's a catalyst for intellectual curiosity.", "likes": 4000}
{"note": "Hello Substack.\n\nI'm Emma, a Psychosexuality nerd, and I love writing about:\n\n🧠 Jungian psychology\n🤼 Sexuality and relationships\n🔥 The psychology of desire\n\nIf you have similar interests, let's connect.\n\n(Algorithm, please show this to relevant people).", "likes": 843}
{"note": "If you are:\n\n• From TikTok and wanting somewhere new to feel smart and loved\n• Interested in reading the news without feeling the blues\n• Really cute and cool and smart and funny\n• Keen to hear funny musings on the world from a Kiwi chick (a New Zealander)\n\nThen our newsletter is for you! I promise! I got you!", "likes": 4400}
{"note": "I love Substack. I have no followers on here. I barely know how to work this app. I suck at writing. I'm 28 and feeling so lost. So stupid. And contemplating if life is worth living on the daily. \n\nBut I get on here and see random people say insightful, encouraging, uplifting things... and it's a sweet reminder, for me, that I'll be okay. It'll be okay.", "likes": 10800}
{"note": "I've been exploring this wonderful world... and would love to know whose work I should follow here? \n\nThought-provoking writers and creative souls, share your favorites with me. 🤍", "likes": 3000}
{"note": "My first week on Substack, I had 5 subscribers—it paid for nothing.\n\nBy month one, I had 1,000 subscribers—it paid for a nice dinner.\n\nBy month three, I was making $3,000/month—it paid for my freedom.\n\nNow, I've grown to over 33,000 subscribers and built a career I love.\n\nThis could be YOU, but you're stuck overthinking your first post.\n\nStop waiting for perfect.\n\nStart messy. I've got you. 💌", "likes": 2300}
{"note": "Ages 20-40, be aware of this:\n\nYour brain peaks in your 20s.\nYour brain starts to decline in your late 30s and early 40s.\n\nYou do not have to accept this as fate.\n\nYou can take small steps to change your trajectory.\n\nThis is my favorite thing to write about. In my newsletter, I share small ways to take control of your brain health.\n\nBecause really, who wants to live to be 100 if your brain peaks before 40?", "likes": 1300}
{"note": "This spring, I will sell my laptop, move to a foreign city (Paris), and attempt to build a new life there without the use of the internet. Once a week, I will go to the library to check email and share my writing. Otherwise, I will rely solely on the postal service and a 2002 dumb phone.\n\nThe question: is it possible to find a home, community, and love without the internet? Let's find out.", "likes": 4200}
{"note": "The border between Finland and Russia is 1,343 km.\n\nThe border between Canada and the USA is 8,891 km.\n\nWe Finns know something about living next to dictatorships.\n\nCanadians know something about living next to madness.\n\nI do not know which is worse.\n\nHang in there, Canadians, like we do here. <3", "likes": 8300}
{"note": "When you follow a leader, consider what would lead you to withdraw your support.\n\nIf the answer is nothing, your integrity is in jeopardy. Your highest loyalty belongs to principles, not people.\n\nNo leader deserves unconditional love. Commitment is earned through character.", "likes": 4800}
{"note": "5 Cheat Codes for Life That No One Tells You:\n\n• Put your alarm clock in the bathroom. You won't snooze.\n• If someone regularly brags about their wealth, income, or success, just assume the reality is about 50% of what they say.\n• If you want to get better at anything, do it for 30 minutes per day for 30 days.\n• Go for a 15-minute walk every morning. It has a positive impact on your mood, sleep, and metabolism.\n• If you're about to take an emotion-based action, wait 24 hours.\n\nYou probably won't see us again, so don't forget to hit the follow button.", "likes": 2800}
{"note": "Medium is dead.\n\nX is rife with misinformation.\n\nFacebook is for Gen X.\n\nInsta is saturated with influencers.\n\nBut Substack?\n\nIt's an underrated gem for creators.", "likes": 5100}
{"note": "At 13, I wanted to be a writer; I wrote in secret.\n\nAt 23, I wanted to be a writer; I got married and graduated from teacher's college.\n\nAt 33, I wanted to be a writer; I had two kids and was teaching full time.\n\nAt 43, I wanted to be a writer; I published my first book.\n\nNow, nearing 53, I am a writer; I'm working on my fifth book and coaching other women to pursue their writing dreams.\n\nKeep going.", "likes": 5300}
{"note": "I decided to keep my Substack free.\n\nYes, I'd love to have thousands of paid subscribers.\n\nYes, I'd love to quit all other work and just write.\n\nYes, I'd love to be on an island, tapping away, all the bills paid.\n\nBut more than that, I want to connect with as many people as possible. I want to share. I want to change the world with my words.\n\nThat's the real gold right there.", "likes": 960}
{"note": "A note about notes.\n\nMy least popular notes aka promoting my work earn me the most immediate money.\n\nMy most popular notes might grow my subscriber base which long term might help me make more money.\n\nEither way, any note I write is a free opportunity for me to connect, share and engage.\n\nAll this to say. Don't overthink your notes. Practice in public. Nobody is really watching so the worst critic is only yourself!", "likes": 789}
